app/views/matches/index.html.erb

SELECT COUNT(*) FROM "boards" WHERE "boards"."match_id" = $1  [["match_id", 1]]
---
        <td><%= match.league %></td>
		<td><%= Board.where(match_id: match.id).size %></td>