app/controllers/boards_controller.rb

SELECT COUNT(*) FROM "boards" WHERE "boards"."user_id" = $1 AND "boards"."match_id" = $2  [["user_id", 1], ["match_id", 1]]
INSERT INTO "boards" ("user_id", "match_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["match_id", 2], ["created_at", "2020-11-27 03:17:22.645106"], ["updated_at", "2020-11-27 03:17:22.645106"]]
---
  def create
    @board = Board.new(board_params)
	user_id=@board.user_id
	match_id=@board.match_id
	@match_overlap=Board.where(user_id: user_id, match_id: match_id).size
    respond_to do |format|
	if @match_overlap > 0
		format.html { redirect_to @board, notice: '중복시청은 되지 않습니다.' }

      elsif @board.save

DELETE FROM "boards" WHERE "boards"."id" = $1  [["id", 1]]
---
  def destroy
    @board.destroy