app/controllers/matches_controller.rb

  def create
    @match = Match.new(match_params)

    respond_to do |format|
      if @match.save
---
INSERT INTO "matches" ("event", "name", "account", "league", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["event", "축구"], ["name", "PSG VS 리버풀"], ["account", 1], ["league", "챔피언스리그"], ["created_at", "2020-11-26 13:15:28.299085"], ["updated_at", "2020-11-26 13:15:28.299085"]]

  def destroy
    @match.destroy
---
DELETE FROM "matches" WHERE "matches"."id" = $1  [["id", 2]]

    def set_match
      @match = Match.find(params[:id])
---
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]