app/controllers/user_accounts_controller.rb

  def index
    @user_accounts = UserAccount.all
---
SELECT "user_accounts".* FROM "user_accounts"

  def create
    @user_account = UserAccount.new(user_account_params)

    respond_to do |format|
      if @user_account.save
---
INSERT INTO "user_accounts" ("bank_name", "acount_number", "cash", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["bank_name", "국민은행"], ["acount_number", "9879456-12302"], ["cash", 50000], ["user_id", 1], ["created_at", "2020-11-27 06:12:53.166548"], ["updated_at", "2020-11-27 06:12:53.166548"]]

  def destroy
    @user_account.destroy
---
DELETE FROM "user_accounts" WHERE "user_accounts"."id" = $1  [["id", 1]]

    def set_user_account
      @user_account = UserAccount.find(params[:id])
---
SELECT  "user_accounts".* FROM "user_accounts" WHERE "user_accounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]